app/controllers/members_controller.rb

SELECT "members".* FROM "members"
---
  def index
    @members = Member.all

INSERT INTO "members" ("first_name", "last_name", "email", "phone", "twitter", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    #@member = Member.new(member_params)
    @member = current_user.members.build(member_params)
    respond_to do |format|
      if @member.save

UPDATE "members" SET "email" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["email", "fakya.jhopnara@gmail.com"], ["updated_at", "2021-11-11 13:27:16.371892"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @member.update(member_params)

DELETE FROM "members" WHERE "members"."id" = ?  [["id", 4]]
---
  def destroy
    @member.destroy

SELECT "members".* FROM "members" WHERE "members"."user_id" = ? AND "members"."id" = ? LIMIT ?  [["user_id", 2], ["id", 4], ["LIMIT", 1]]
---
  def correct_user
    @member = current_user.members.find_by(id: params[:id])

SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_member
      @member = Member.find(params[:id])